Documents/ПродажаИзделий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПродажаИзделий</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиИзделий</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПродажаИзделий/Ext/ManagerModule.bsl
Процедура ПечатьЧека(ТабДок, Ссылка) Экспорт
	Макет = Документы.ПродажаИзделий.ПолучитьМакет("Чек");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПродажаИзделий.Ссылка КАК Ссылка,
	               |	ПродажаИзделий.ВерсияДанных КАК ВерсияДанных,
	               |	ПродажаИзделий.ПометкаУдаления КАК ПометкаУдаления,
	               |	ПродажаИзделий.Номер КАК Номер,
	               |	ПродажаИзделий.Дата КАК Дата,
	               |	ПродажаИзделий.Проведен КАК Проведен,
	               |	ПродажаИзделий.Склад КАК Склад,
	               |	ПродажаИзделий.Клиент КАК Клиент,
	               |	ПродажаИзделий.Продавец КАК Продавец,
	               |	ПродажаИзделий.ПереченьНоменклатуры.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Цена КАК Цена,
	               |		Количество КАК Количество,
	               |		Сумма КАК Сумма
	               |	) КАК ПереченьНоменклатуры,
	               |	ПродажаИзделий.Представление КАК Представление,
	               |	ПродажаИзделий.МоментВремени КАК МоментВремени
	               |ИЗ
	               |	Документ.ПродажаИзделий КАК ПродажаИзделий
	               |ГДЕ
	               |	ПродажаИзделий.Ссылка = &Ссылка";
	Запрос.Параметры.Вставить("Ссылка",Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Ссылка.Проведен Тогда
		Возврат;
	КонецЕсли;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьСписокУслуг = Макет.ПолучитьОбласть("СписокУслуг");
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.Очистить();

	ОбластьЗаголовок.Параметры.Дата = Формат(Ссылка.Дата, "ДЛФ = ДД");
	ОбластьЗаголовок.Параметры.Номер = Ссылка.Номер;
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ИтогСумма = 0;
	Пока Выборка.Следующий() Цикл
		ВыборкаПереченьНоменклатуры = Выборка.ПереченьНоменклатуры.Выбрать();
		Пока ВыборкаПереченьНоменклатуры.Следующий() Цикл
			ОбластьСписокУслуг.Параметры.Номенклатура = ВыборкаПереченьНоменклатуры.Номенклатура;
			ОбластьСписокУслуг.Параметры.Количество = ВыборкаПереченьНоменклатуры.Количество;
			ОбластьСписокУслуг.Параметры.Цена = ВыборкаПереченьНоменклатуры.Цена;
			ОбластьСписокУслуг.Параметры.Сумма = ВыборкаПереченьНоменклатуры.Сумма;
			
			ТабДок.Вывести(ОбластьСписокУслуг);
			ИтогСумма = ИтогСумма + ВыборкаПереченьНоменклатуры.Сумма;
		КонецЦикла;
	    ОбластьИтоги.Параметры.Итог = ИтогСумма;
		ТабДок.Вывести(ОбластьИтоги);
	КонецЦикла;
	ОбластьПодвал.Параметры.Продавец = Ссылка.Продавец;
	ТабДок.Вывести(ОбластьПодвал);
	
	//~метка:
	//Сообщить("Документ № " + Ссылка + " НЕ проведен!");
КонецПроцедуры
